Mysteo91/stm32-periph-utils/lib/uartLib/src/user_layer/uart.c
            }
        }
        UART_HandleTypeDef *huart = getUartHalHandleByDMA(dmaHandle->Instance);
        __HAL_LINKDMA(huart, hdmarx, *dmaHandle);

        if (HAL_DMA_ConfigChannelAttributes(dmaHandle, DMA_CHANNEL_NPRIV) != HAL_OK) {
            //@todo for debugging only
            while (1) {

            }
        }
    }
}

void initDmaCircularForUART(DMA_HandleTypeDef *dmaHandle, uint32_t DMA_REQUEST, uint32_t DMA_CCR) {
    dmaHandle->Init.Request = DMA_REQUEST;
    dmaHandle->Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
    UART_HandleTypeDef *huart = getUartHalHandleByDMA(dmaHandle->Instance);
    uart_t *uart = getUartByHalHandle(huart);
    DMA_NodeConfTypeDef NodeConfig = {0};

    NodeConfig.NodeType = DMA_GPDMA_LINEAR_NODE;
    NodeConfig.Init.Request = GPDMA1_REQUEST_USART2_RX;
    NodeConfig.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
    NodeConfig.Init.Direction = DMA_PERIPH_TO_MEMORY;
    NodeConfig.Init.SrcInc = DMA_SINC_FIXED;
    NodeConfig.Init.DestInc = DMA_DINC_INCREMENTED;
    NodeConfig.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
    NodeConfig.Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
    NodeConfig.Init.SrcBurstLength = 1;
    NodeConfig.Init.DestBurstLength = 1;
    NodeConfig.Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
    NodeConfig.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
    NodeConfig.Init.Mode = DMA_NORMAL;
    NodeConfig.TriggerConfig.TriggerPolarity = DMA_TRIG_POLARITY_MASKED;
    NodeConfig.DataHandlingConfig.DataExchange = DMA_EXCHANGE_NONE;
    NodeConfig.DataHandlingConfig.DataAlignment = DMA_DATA_RIGHTALIGN_ZEROPADDED;
    if (HAL_DMAEx_List_BuildNode(&NodeConfig, &uart->dma.nodeRx) != HAL_OK) {
        while (1) {
            //@todo ERROR handler
        }
    }

    if (HAL_DMAEx_List_InsertNode(&uart->dma.listRx, NULL, &uart->dma.nodeRx) != HAL_OK) {
        while (1) {
            //@todo ERROR handler
        }
    }

    if (HAL_DMAEx_List_SetCircularMode(&uart->dma.listRx) != HAL_OK) {
        while (1) {
            //@todo ERROR handler
        }
    }


    dmaHandle->InitLinkedList.Priority = DMA_CCR;
    dmaHandle->InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
    dmaHandle->InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
    dmaHandle->InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
    dmaHandle->InitLinkedList.LinkedListMode = DMA_LINKEDLIST_CIRCULAR;
    if (HAL_DMAEx_List_Init(dmaHandle) != HAL_OK) {
        while (1) {
            //@todo ERROR handler
        }
    }

    if (HAL_DMAEx_List_LinkQ(dmaHandle, &uart->dma.listRx) != HAL_OK) {
        while (1) {
            //@todo ERROR handler
        }
    }

    __HAL_LINKDMA(huart, hdmarx, *dmaHandle);

    if (HAL_DMA_ConfigChannelAttributes(dmaHandle, DMA_CHANNEL_NPRIV) != HAL_OK) {
        while (1) {
            //@todo ERROR handler
        }
    }
}

void setPriorityDMA(DMA_Channel_TypeDef *dmaChannel, uint8_t priority) {
    if (dmaChannel == GPDMA1_Channel0) {
        HAL_NVIC_SetPriority(GPDMA1_Channel0_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel0_IRQn);
    } else if (dmaChannel == GPDMA1_Channel1) {
        HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);
    } else if (dmaChannel == GPDMA1_Channel2) {
        HAL_NVIC_SetPriority(GPDMA1_Channel2_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel2_IRQn);
    } else if (dmaChannel == GPDMA1_Channel3) {
        HAL_NVIC_SetPriority(GPDMA1_Channel3_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel3_IRQn);
    } else if (dmaChannel == GPDMA1_Channel4) {
        HAL_NVIC_SetPriority(GPDMA1_Channel4_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel4_IRQn);
    } else if (dmaChannel == GPDMA1_Channel5) {
        HAL_NVIC_SetPriority(GPDMA1_Channel5_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel5_IRQn);
    } else if (dmaChannel == GPDMA1_Channel6) {
        HAL_NVIC_SetPriority(GPDMA1_Channel6_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel6_IRQn);
    } else if (dmaChannel == GPDMA1_Channel7) {
        HAL_NVIC_SetPriority(GPDMA1_Channel7_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA1_Channel7_IRQn);
    } else if (dmaChannel == GPDMA2_Channel0) {
        HAL_NVIC_SetPriority(GPDMA2_Channel0_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel0_IRQn);
    } else if (dmaChannel == GPDMA2_Channel1) {
        HAL_NVIC_SetPriority(GPDMA2_Channel1_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel1_IRQn);
    } else if (dmaChannel == GPDMA2_Channel2) {
        HAL_NVIC_SetPriority(GPDMA2_Channel2_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel2_IRQn);
    } else if (dmaChannel == GPDMA2_Channel3) {
        HAL_NVIC_SetPriority(GPDMA2_Channel3_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel3_IRQn);
    } else if (dmaChannel == GPDMA2_Channel4) {
        HAL_NVIC_SetPriority(GPDMA2_Channel4_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel4_IRQn);
    } else if (dmaChannel == GPDMA2_Channel5) {
        HAL_NVIC_SetPriority(GPDMA2_Channel5_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel5_IRQn);
    } else if (dmaChannel == GPDMA2_Channel6) {
        HAL_NVIC_SetPriority(GPDMA2_Channel6_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel6_IRQn);
    } else if (dmaChannel == GPDMA2_Channel7) {
        HAL_NVIC_SetPriority(GPDMA2_Channel7_IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(GPDMA2_Channel7_IRQn);
    }
}

void resetUART(uart_t *uart) {
    uart->countTC = 0;
    uint8_t* tmpPnt = uart->huart.pRxBuffPtr;
    uint16_t tmpSize = uart->huart.RxXferSize;
    uart->lastWrtPnt = uart->huart.pRxBuffPtr;
    HAL_UART_DMAStop(&uart->huart);
    uartStartReceive(uart->huart.Instance, tmpPnt, tmpSize);
}


static void handleCircularUart(uart_t *uart, uint16_t size) {
    if (uart->huart.RxEventType == HAL_UART_RXEVENT_TC) {
        uart->countTC++;
        return;
    } else if (uart->huart.RxEventType == HAL_UART_RXEVENT_IDLE) {

        if (uart->countTC > 1) {
            resetUART(uart);
            return;
        }

        uart->countTC = 0;
        uint8_t *tmpPos = uart->lastWrtPnt;
        uint32_t realSize = 0;
        bool overHead = false;

        if (uart->lastWrtPnt < (uart->huart.pRxBuffPtr + size)) {
            realSize = size - (uart->lastWrtPnt - uart->huart.pRxBuffPtr);
            uart->lastWrtPnt += realSize;
        } else {
            overHead = true;
            realSize = uart->huart.pRxBuffPtr + uart->huart.RxXferSize - uart->lastWrtPnt + size;
            uart->lastWrtPnt = uart->huart.pRxBuffPtr + size;
        }

        if (uart->lastWrtPnt == uart->huart.pRxBuffPtr + size) {
            uart->lastWrtPnt = uart->huart.pRxBuffPtr;
        }

        if (overHead == false) {
            uart->dataCb(tmpPos, realSize, NULL, 0);
        } else {
            uart->dataCb(tmpPos, uart->huart.pRxBuffPtr + size - tmpPos, uart->huart.pRxBuffPtr, size);
        }
    }
}


void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t size) {

    uart_t *uart = getUartByHalHandle(huart);
    if (huart->hdmarx->Init.Mode == DMA_NORMAL) {
        if (uart->dataCb != NULL)
            uart->dataCb((uint8_t *) huart->pRxBuffPtr, NULL, size, 0);
    } else {
        if (uart->dataCb != NULL) {

        }
    }

}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {


}



